cr1901/msp430g2xx/svds/msp430g2x32.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC10</name>
      <description>ADC10</description>
      <baseAddress>72</baseAddress>
      <registers>
        <register>
          <name>ADC10DTC0</name>
          <description>ADC10 Data Transfer Control 0</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>ADC10FETCH</name>
              <description>This bit should normally be reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10B1</name>
              <description>ADC10 block one</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10CT</name>
              <description>ADC10 continuous transfer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10TB</name>
              <description>ADC10 two-block mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC10DTC1</name>
          <description>ADC10 Data Transfer Control 1</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>ADC10DTC1</name>
              <description>ADC10 Data Transfer Control 1 register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC10AE0</name>
          <description>ADC10 Analog Enable 0</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>ADC10AE0</name>
              <description>ADC10 Analog Enable 0 register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC10CTL0</name>
          <description>ADC10 Control 0</description>
          <addressOffset>360</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC10SC</name>
              <description>ADC10 Start Conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENC</name>
              <description>ADC10 Enable Conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10IFG</name>
              <description>ADC10 Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10IE</name>
              <description>ADC10 Interrupt Enalbe</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10ON</name>
              <description>ADC10 On/Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFON</name>
              <description>ADC10 Reference on</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF2_5V</name>
              <description>ADC10 Ref 0:1.5V / 1:2.5V</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSC</name>
              <description>ADC10 Multiple SampleConversion</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFBURST</name>
              <description>ADC10 Reference Burst Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFOUT</name>
              <description>ADC10 Enalbe output of Ref.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10SR</name>
              <description>ADC10 Sampling Rate 0:200ksps / 1:50ksps</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10SHT</name>
              <description>ADC10 Sample Hold Select Bit: 0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10SHT_0</name>
                  <description>4 x ADC10CLKs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_1</name>
                  <description>8 x ADC10CLKs</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_2</name>
                  <description>16 x ADC10CLKs</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_3</name>
                  <description>64 x ADC10CLKs</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SREF</name>
              <description>ADC10 Reference Select Bit: 0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SREF_0</name>
                  <description>VR+ = AVCC and VR- = AVSS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_1</name>
                  <description>VR+ = VREF+ and VR- = AVSS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_2</name>
                  <description>VR+ = VEREF+ and VR- = AVSS</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_3</name>
                  <description>VR+ = VEREF+ and VR- = AVSS</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_4</name>
                  <description>VR+ = AVCC and VR- = VREF-/VEREF-</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_5</name>
                  <description>VR+ = VREF+ and VR- = VREF-/VEREF-</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_6</name>
                  <description>VR+ = VEREF+ and VR- = VREF-/VEREF-</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_7</name>
                  <description>VR+ = VEREF+ and VR- = VREF-/VEREF-</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC10CTL1</name>
          <description>ADC10 Control 1</description>
          <addressOffset>362</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC10BUSY</name>
              <description>ADC10 BUSY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONSEQ</name>
              <description>ADC10 Conversion Sequence Select 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONSEQ_0</name>
                  <description>Single channel single conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONSEQ_1</name>
                  <description>Sequence of channels</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONSEQ_2</name>
                  <description>Repeat single channel</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONSEQ_3</name>
                  <description>Repeat sequence of channels</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC10SSEL</name>
              <description>ADC10 Clock Source Select Bit: 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10SSEL_0</name>
                  <description>ADC10OSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SSEL_1</name>
                  <description>ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SSEL_2</name>
                  <description>MCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SSEL_3</name>
                  <description>SMCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC10DIV</name>
              <description>ADC10 Clock Divider Select Bit: 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10DIV_0</name>
                  <description>ADC10 Clock Divider Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_1</name>
                  <description>ADC10 Clock Divider Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_2</name>
                  <description>ADC10 Clock Divider Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_3</name>
                  <description>ADC10 Clock Divider Select 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_4</name>
                  <description>ADC10 Clock Divider Select 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_5</name>
                  <description>ADC10 Clock Divider Select 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_6</name>
                  <description>ADC10 Clock Divider Select 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10DIV_7</name>
                  <description>ADC10 Clock Divider Select 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISSH</name>
              <description>ADC10 Invert Sample Hold Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10DF</name>
              <description>ADC10 Data Format 0:binary 1:2's complement</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHS</name>
              <description>ADC10 Sample/Hold Source Bit: 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHS_0</name>
                  <description>ADC10SC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHS_1</name>
                  <description>TA3 OUT1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHS_2</name>
                  <description>TA3 OUT0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHS_3</name>
                  <description>TA3 OUT2</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INCH</name>
              <description>ADC10 Input Channel Select Bit: 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCH_0</name>
                  <description>Selects Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_1</name>
                  <description>Selects Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_2</name>
                  <description>Selects Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_3</name>
                  <description>Selects Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_4</name>
                  <description>Selects Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_5</name>
                  <description>Selects Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_6</name>
                  <description>Selects Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_7</name>
                  <description>Selects Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_8</name>
                  <description>Selects Channel 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_9</name>
                  <description>Selects Channel 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_10</name>
                  <description>Selects Channel 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_11</name>
                  <description>Selects Channel 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_12</name>
                  <description>Selects Channel 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_13</name>
                  <description>Selects Channel 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_14</name>
                  <description>Selects Channel 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCH_15</name>
                  <description>Selects Channel 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC10MEM</name>
          <description>ADC10 Memory</description>
          <addressOffset>364</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC10MEM</name>
              <description>ADC10 Memory register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC10SA</name>
          <description>ADC10 Data Transfer Start Address</description>
          <addressOffset>372</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC10SA</name>
              <description>ADC10 Data Transfer Start Address register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
